** Primitives in LISP/Scheme
Every powerful language has three mechanisms to accomplish the construction of complex ideas from simple ones:
- primtive expressions, which represent the simplest entities the language is concerned with.
- means of combination, by which compound elements are built from simpler ones.
- means of abstraction, by which compound elements can be named and manipulated as units.
Expressions representing numbers maay be combined with an expression representing a primitive procedure (such as + or /).
Expressions formed by deliminiting a list of expressions within a set of parentheses are called *combinations*. The left more elements are called *operands*.
Note that simply expressing a number itself is a primitive operation.
#+begin_src scheme
(/ 140 120)
#+end_src
#+RESULTS:
: 7/6
#+begin_src scheme
(/ 143.2 120)
#+end_src
#+RESULTS:
: 1.1933333333333331
#+begin_src scheme
(* 143 120)
#+end_src
#+RESULTS:
: 17160
#+begin_src scheme
(+ 143 120)
#+end_src
#+RESULTS:
: 263
#+begin_src scheme
(- 143 120)
#+end_src
#+RESULTS:
: 23

** Square Roots By Newton's Method
Consider that by square-root function of mathematics, we mean a function f(z) >= 0 such that f(z)^2 = z. This is a perfectly legitimate mathematical function, we can use it to test whether a number is a squareroot of another, or derive properties of squareroots, it does not however describe a *procedure*.
This embodies the distinction between declarative and imperative knowledge.
If we want to procedurally compute the squareroot of a number, we apply an approximation routine due to Newton.
#+begin_src scheme
(define (sqrt-iter guess x)
  (if (good-enough? guess x)
      guess
      (sqrt-iter (improve guess x) x)))
#+end_src
We improve the guess by averaging the sum of the current guess and x / current guess.
#+begin_src scheme
(define (improve guess x)
  (average guess (/ x guess)))
#+end_src
We implement the average of two numbers:
#+begin_src scheme
(define (average x y)
  (/ (+ x y) 2))
#+end_src
One way to implement good-enough? would be to look at the absolute value of the difference of the square of the current guess and x and try to get it sufficiently small. I differ from SICP here and include a tolerance variable to supplied by the user.
#+begin_src scheme
(define (good-enough? guess x tolerance)
  (< (abs (- (square guess) x)) tolerance))
#+end_src
Abs and square have been implemented previously, and with them we have the full implementation:
#+begin_src scheme
(define (sqrt-iter guess x tolerance)
  (if (good-enough? guess x tolerance)
      guess
      (sqrt-iter (improve guess x) x tolerance)))
(define (improve guess x)
  (average guess (/ x guess)))
(define (average x y)
  (/ (+ x y) 2))
(define (good-enough? guess x tolerance)
  (< (abs (- (square guess) x)) tolerance))
(define (abs x)
  (if (< x 0)
      (- x)
      x))
(define (square x) (* x x))
(sqrt-iter 1.8 2 0.0001)
#+end_src

#+RESULTS:
: 1.4142136841942816

*** 1.7
- The good-enough? test used in computing square roots will not be very effective for finding the square roots of very small numbers. Also, in real computers, arithmetic operations are almost always performed with limited precision. This makes our test inadequate for very large numbers. Explain these statements, with examples showing how the test fails for small and large numbers. An alternative strategy for implementing good-enough? is to watch how guess changes from one iteration to the next and to stop when the change is a very small fraction of the guess. Design a square-root procedure that uses this kind of end test. Does this work better for small and large numbers?
This is a space comlexity issue. Because when we are testing to see if our guess is indeed a squareroot, we invoke squaring of the number; this value, grows like like g^2. Because small numbers are floats, operationally, they present the same space complexity problem to the CPU. Testing the difference in the next guess iteration is more effective because here the testing clause evolves purely linearly. However, in my case, a precise enough choice of tolerance is destined to break the evaluation, it will occur when the value given is smaller than the smallest precision float my CPU can represent.
#+begin_src scheme
(define (sqrt-iter guess x tolerance)
  (if (good-enough? guess (improve guess x) tolerance)
      guess
      (sqrt-iter (improve guess x) x tolerance)))
(define (improve guess x)
  (average guess (/ x guess)))
(define (average x y)
  (/ (+ x y) 2))
(define (good-enough? guess next-guess tolerance)
  (< (abs (- guess next-guess)) tolerance))
(define (abs x)
  (if (< x 0)
      (- x)
      x))
(define (square x) (* x x))
(sqrt-iter 1 1000000.0 0.0001)
#+end_src
#+RESULTS:
: 1000.0000000000118

*** 1.8
Newton's method for cube roots is based on the fact that if y is an approximation to the cube root of x, then a better approximation is given by the value: (x/y^2 + 2y) / 3. (The derivation of this is anlogous to the square case).
#+begin_src scheme
(define (cube-iter guess x tolerance)
  (if (good-enough? guess (improve guess x) tolerance)
      guess
      (cube-iter (improve guess x) x tolerance)))
(define (improve guess x)
  (average (* 2 guess) (/ x (square guess))))
(define (average x y)
  (/ (+ x y) 3))
(define (good-enough? guess next-guess tolerance)
  (< (abs (- guess next-guess)) tolerance))
(define (abs x)
  (if (< x 0)
      (- x)
      x))
(define (square x) (* x x))
(cube-iter 1 8.0 0.0001)
#+end_src

#+RESULTS:
: 2.000004911675504

** Internal Definitions and Block Structure
We should probably be defining auxiliary procedures INSIDE of a sqrt function. The reason is 2 fold. For one, users do not care about the auxiliary procedures like good-enough? and improve. Secondly, and more importantly, many functions may have their own procedures named good-enough? and improve, and we would like to keep these functions local ONLY to the sqrt function so there cannot be scoping interference.
#+begin_src scheme
(define (square x) (* x x))
(define (average x y) (/ (+ x y) 2))
(define (abs x) (if (< x 0) (- x) x))
(define (sqrt x)
  (define (good-enough? guess x)
    (< (abs (- (square guess) x)) 0.001))
  (define (improve guess x)
    (average guess (/ x guess)))
  (define (sqrt-iter guess x)
    (if (good-enough? guess x)
        guess
        (sqrt-iter (improve guess x) x)))
  (sqrt-iter 1.0 x))
#+end_src

This is called *block structure*. Another thing which we can do is remove the explicit formal parameters given in the auxiliary procedure definition which are already given by sqrt; x. This is what *lexical scoping* is.
#+begin_src scheme
(define (square x) (* x x))
(define (average x y) (/ (+ x y) 2))
(define (abs x) (if (< x 0) (- x) x))
(define (sqrt x)
  (define (good-enough? guess)
    (< (abs (- (square guess) x)) 0.001))
  (define (improve guess)
    (average guess (/ x guess)))
  (define (sqrt-iter guess)
    (if (good-enough? guess)
        guess
        (sqrt-iter (improve guess))))
  (sqrt-iter 1.0))
(sqrt 16)
#+end_src

#+RESULTS:
: 4.000000636692939

Block structure originated with the programming language ALGOL 60.

